

## 1. 文本删除线效果
在需要删除线效果的单行文本两侧加`~~`，例如
```
~~test~~
```
效果如下：

~~test~~

但对于多行文本，使用

~~test1

test2~~


我们发现没有效果，此时有两种方法，

1. 每行都用`~~`包起来，即
```
~~test1~~

~~test2~~
```
2. 利用html的`<s>`删除线标签
```
<s>test1

test2~~</s>
```
效果如下：

<s>test1

test2</s>

## 2. 区块引用的换行

我们可以在文明前使用`>` 来对文本样式进行特殊的展示，常用于引用、说明、标注，例如
```
> test
```
效果如下：

> test

对于多行文本，使用
```
> test1
> test2
```
效果如下：

> test1
> test2

我们发现 test1 test2处于同一行，解决方法有两种
1. 加入空的`>`行
```
> test1
>
> test2
```
效果如下,会多一个空行：

> test1
>
> test2

2. 行末加入`\`
```
> test1\
> test2
```
效果如下：
> test1\
> test2